---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.CurveByPointsArray
source: html/a0dcca8c-ebdb-cc4f-d6ee-bfddacac1a2b.htm
---
# CurveByPointsArray Members

Initializes a new instance of the CurveByPointsArray class